Revit 2027 API
DocumentSaveToCentralProgressChangedEventArgs Properties
The DocumentSaveToCentralProgressChangedEventArgs type exposes the following members.
Properties
Name | Description
Cancellable |  Indicates whether an event may be cancelled by an event delegate.
(Inherited from RevitAPIEventArgs)
FailureDueToConflicts |  Indicates the 'save to central' failure is caused by submission conflicts, that is because another one finished saving to central first.
FinishedSize |  The transferred data size, in bytes, since the last time this event was raised.
(Inherited from DataTransferProgressChangedEventArgs)
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
(Inherited from RevitAPIEventArgs)
Location |  Full path of the central model which is to be operated.
(Inherited from WorksharedOperationProgressChangedEventArgs)
RetryTimes |  The number of times Revit has tried to Save to Central." Its value is '0' at the first time.
SaveToCentralFinished |  Indicates if current 'save to central' is finished.
Speed |  Speed(bytes/second) in this event.
(Inherited from DataTransferProgressChangedEventArgs)
Status |  Gets API event status, reflect current operation execution status.
(Inherited from WorksharedOperationProgressChangedEventArgs)
TotalSize |  Total expected data size to transfer, in bytes.
(Inherited from DataTransferProgressChangedEventArgs)
TransferMode |  Data transfer mode in this event.
(Inherited from DataTransferProgressChangedEventArgs)
Top
See Also
Reference
DocumentSaveToCentralProgressChangedEventArgs Class
Autodesk.Revit.DB.Events Namespace